rooted-foods-api/app/controllers/sessions_controller.rb

    def create
      user = (User.find_by_email(params[:username_or_email]) || User.find_by_username(params[:username_or_email]))
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "GrahamSM"]]